#include "DebugLog.h"

#include <fstream>

namespace
{
	//---------------------------------------------------------
	// ログファイル
	//---------------------------------------------------------
	const char* FILE_PATH = "DebugLog/log.txt";
}

//---------------------------------------------------------
// ログ出力
//---------------------------------------------------------
void DebugLog::Write(const char* text)
{
	//---------------------------------------------------------
	// 追記モードで開く
	//---------------------------------------------------------
	std::ofstream file(FILE_PATH, std::ios::app);

	if (!file)
	{
		return;
	}

	file << text << std::endl;

	file.close();
}