#pragma once

#include <d3d11.h>
#include <wrl/client.h>
#include <string>

class Texture
{
public:
	Texture() = default;
	~Texture() = default;

	//---------------------------------------------------------
	//テクスチャ読み込み
	// filePath : 読み込む画像ファイルのパス(png jpg bmpなど)
	//---------------------------------------------------------
	bool Load(const std::string& filePath);

	//---------------------------------------------------------
	//シェーダーへ設定
	//slot : シェーダーのテクスチャスロット番号(t0, t1, t2...)
	//---------------------------------------------------------
	void SetPS(UINT slot);

	//---------------------------------------------------------
	//SRV取得
	//---------------------------------------------------------
	ID3D11ShaderResourceView* GetSRV() const
	{
		return m_srv.Get();
	}
	
	//---------------------------------------------------------
	//画像サイズ取得
	//---------------------------------------------------------
	UINT GetWidth() const
	{
		return m_width;
	}
	UINT GetHeight() const
	{
		return m_height;
	}

private:
	//---------------------------------------------------------
	//GPU上のテクスチャ
	//---------------------------------------------------------
	Microsoft::WRL::ComPtr<ID3D11Texture2D> m_texture;

	//---------------------------------------------------------
	//シェーダーリソースビュー(SRV)、シェーダーからテクスチャを参照するためのビュー
	//---------------------------------------------------------
	Microsoft::WRL::ComPtr<ID3D11ShaderResourceView> m_srv;

	//---------------------------------------------------------
	//画像サイズ
	//---------------------------------------------------------
	UINT m_width = 0;
	UINT m_height = 0;
};